import Vue from 'vue'
import Vuex from 'vuex'

Vue.use(Vuex)


const index = new Vuex.Store({
    state: {
      user:{
        admin:5,
        "很不U":2,
        open:1,
        "阿梅":2,
        peko:1,
        whoiswho:3,
        AAAA:2,
        BBBB:2,
        CCCC:1,
      },
      userName:"",
      Lv:'3',
      selectData:"Regular exercise rate of population over 65",
      veType:'histogram',
      "Regular exercise rate of population over 65":{
        columns: ['年份別', '有效樣本數', '合計 (%)', '男性 (%)', '女性 (%)'],
        rows: [
          {
            "年份別": "96",
            "有效樣本數": "1846",
            "合計 (%)": "41.2",
            "男性 (%)": "43.2",
            "女性 (%)": "38.5"
          },
          {
            "年份別": "97",
            "有效樣本數": "1760",
            "合計 (%)": "39.7",
            "男性 (%)": "42.3",
            "女性 (%)": "37.1"
          },
          {
            "年份別": "98",
            "有效樣本數": "1718",
            "合計 (%)": "45.4",
            "男性 (%)": "48.5",
            "女性 (%)": "42.3"
          },
          {
            "年份別": "99",
            "有效樣本數": "1886",
            "合計 (%)": "50.9",
            "男性 (%)": "55.8",
            "女性 (%)": "46.3"
          },
          {
            "年份別": "100",
            "有效樣本數": "2321",
            "合計 (%)": "49.6",
            "男性 (%)": "55.3",
            "女性 (%)": "44.2"
          },
          {
            "年份別": "101",
            "有效樣本數": "2791",
            "合計 (%)": "53.4",
            "男性 (%)": "54.6",
            "女性 (%)": "52.2"
          },
          {
            "年份別": "102",
            "有效樣本數": "3852",
            "合計 (%)": "55.4",
            "男性 (%)": "57",
            "女性 (%)": "54.1"
          },
          {
            "年份別": "103",
            "有效樣本數": "4383",
            "合計 (%)": "56.4",
            "男性 (%)": "57.3",
            "女性 (%)": "55.6"
          },
          {
            "年份別": "104",
            "有效樣本數": "4980",
            "合計 (%)": "58.9",
            "男性 (%)": "58.5",
            "女性 (%)": "59.3"
          }
        ]
      },
      "The prevalence of diabetes among people over 20 years old":{
        columns: ['年份別', '有效樣本數', '合計 (%)', '男性 (%)', '女性 (%)'],
        rows: [
          {
            "年份別": "94-97",
            "有效樣本數": "1577",
            "合計 (%)": "8.5",
            "男性 (%)": "10.4",
            "女性 (%)": "6.6"
          },
          {
            "年份別": "102-103",
            "有效樣本數": "1460",
            "合計 (%)": "13.2",
            "男性 (%)": "16.2",
            "女性 (%)": "10.5"
          },
          {
            "年份別": "102-104",
            "有效樣本數": "2195",
            "合計 (%)": "12.3",
            "男性 (%)": "14.5",
            "女性 (%)": "10.4"
          }
        ]
      },
      "Overweight and obesity rates over 18 years old over the years":{
        columns: ['依年度別分by year', '有效樣本數Sample Size', '男Male (%)', '女Female (%)', '不分性別Both (%)'],
        rows: [
          {
            "依年度別分by year": "2008",
            "有效樣本數Sample Size": "15860",
            "男Male (%)": "46.18",
            "女Female (%)": "28.37",
            "不分性別Both (%)": "37.48"
          },
          {
            "依年度別分by year": "2009",
            "有效樣本數Sample Size": "15418",
            "男Male (%)": "47.73",
            "女Female (%)": "27.87",
            "不分性別Both (%)": "37.98"
          },
          {
            "依年度別分by year": "2010",
            "有效樣本數Sample Size": "15499",
            "男Male (%)": "48.53",
            "女Female (%)": "28.04",
            "不分性別Both (%)": "38.53"
          },
          {
            "依年度別分by year": "2011",
            "有效樣本數Sample Size": "16119",
            "男Male (%)": "48.86",
            "女Female (%)": "28.56",
            "不分性別Both (%)": "38.95"
          },
          {
            "依年度別分by year": "2012",
            "有效樣本數Sample Size": "16013",
            "男Male (%)": "49.06",
            "女Female (%)": "29.35",
            "不分性別Both (%)": "39.3"
          },
          {
            "依年度別分by year": "2013",
            "有效樣本數Sample Size": "22579",
            "男Male (%)": "49.64",
            "女Female (%)": "30.52",
            "不分性別Both (%)": "40.12"
          }
        ]
      },
      "exchange rate":{
        columns: ['日期', '美元:新台幣', '人民幣:新台幣', '歐元:美元', '美元:日幣','英鎊:美元','澳幣:美元','美元:港幣','美元:人民幣','美元:南非幣','紐幣:美元'],
        rows: [
          {
            "日期": "20201005",
            "美元:新台幣": "29.02",
            "人民幣:新台幣": "4.29882",
            "歐元:美元": "1.17405",
            "美元:日幣": "105.645",
            "英鎊:美元": "1.2947",
            "澳幣:美元": "0.71775",
            "美元:港幣": "7.75005",
            "美元:人民幣": "6.7507",
            "美元:南非幣": "16.4019",
            "紐幣:美元": "0.66435"
          },
          {
            "日期": "20201006",
            "美元:新台幣": "28.96",
            "人民幣:新台幣": "4.300705",
            "歐元:美元": "1.17735",
            "美元:日幣": "105.555",
            "英鎊:美元": "1.297",
            "澳幣:美元": "0.7156",
            "美元:港幣": "7.75005",
            "美元:人民幣": "6.7338",
            "美元:南非幣": "16.63735",
            "紐幣:美元": "0.66365"
          },
          {
            "日期": "20201007",
            "美元:新台幣": "28.965",
            "人民幣:新台幣": "4.300086",
            "歐元:美元": "1.1752",
            "美元:日幣": "105.915",
            "英鎊:美元": "1.29165",
            "澳幣:美元": "0.71335",
            "美元:港幣": "7.7501",
            "美元:人民幣": "6.7359",
            "美元:南非幣": "16.6075",
            "紐幣:美元": "0.6597"
          },
          {
            "日期": "20201008",
            "美元:新台幣": "28.966",
            "人民幣:新台幣": "4.301828",
            "歐元:美元": "1.1764",
            "美元:日幣": "105.935",
            "英鎊:美元": "1.2962",
            "澳幣:美元": "0.71655",
            "美元:港幣": "7.75005",
            "美元:人民幣": "6.7334",
            "美元:南非幣": "16.59645",
            "紐幣:美元": "0.65935"
          },
          {
            "日期": "20201012",
            "美元:新台幣": "28.909",
            "人民幣:新台幣": "4.303798",
            "歐元:美元": "1.18155",
            "美元:日幣": "105.575",
            "英鎊:美元": "1.3036",
            "澳幣:美元": "0.7231",
            "美元:港幣": "7.75005",
            "美元:人民幣": "6.7171",
            "美元:南非幣": "16.47935",
            "紐幣:美元": "0.66625"
          },
          {
            "日期": "20201013",
            "美元:新台幣": "28.92",
            "人民幣:新台幣": "4.289096",
            "歐元:美元": "1.1785",
            "美元:日幣": "105.455",
            "英鎊:美元": "1.3031",
            "澳幣:美元": "0.71845",
            "美元:港幣": "7.75005",
            "美元:人民幣": "6.7427",
            "美元:南非幣": "16.53065",
            "紐幣:美元": "0.6652"
          },
          {
            "日期": "20201014",
            "美元:新台幣": "28.952",
            "人民幣:新台幣": "4.297316",
            "歐元:美元": "1.1739",
            "美元:日幣": "105.395",
            "英鎊:美元": "1.2887",
            "澳幣:美元": "0.7171",
            "美元:港幣": "7.75015",
            "美元:人民幣": "6.73725",
            "美元:南非幣": "16.54885",
            "紐幣:美元": "0.66595"
          },
          {
            "日期": "20201015",
            "美元:新台幣": "28.96",
            "人民幣:新台幣": "4.307742",
            "歐元:美元": "1.17275",
            "美元:日幣": "105.185",
            "英鎊:美元": "1.2994",
            "澳幣:美元": "0.7097",
            "美元:港幣": "7.75005",
            "美元:人民幣": "6.7228",
            "美元:南非幣": "16.6298",
            "紐幣:美元": "0.6629"
          },
          {
            "日期": "20201016",
            "美元:新台幣": "28.979",
            "人民幣:新台幣": "4.326275",
            "歐元:美元": "1.17115",
            "美元:日幣": "105.26",
            "英鎊:美元": "1.29365",
            "澳幣:美元": "0.70855",
            "美元:港幣": "7.75005",
            "美元:人民幣": "6.69835",
            "美元:南非幣": "16.57425",
            "紐幣:美元": "0.6607"
          },
          {
            "日期": "20201019",
            "美元:新台幣": "28.95",
            "人民幣:新台幣": "4.32652",
            "歐元:美元": "1.1729",
            "美元:日幣": "105.38",
            "英鎊:美元": "1.29945",
            "澳幣:美元": "0.70935",
            "美元:港幣": "7.75005",
            "美元:人民幣": "6.6913",
            "美元:南非幣": "16.50035",
            "紐幣:美元": "0.6625"
          },
          {
            "日期": "20201020",
            "美元:新台幣": "28.932",
            "人民幣:新台幣": "4.33601",
            "歐元:美元": "1.1782",
            "美元:日幣": "105.555",
            "英鎊:美元": "1.2948",
            "澳幣:美元": "0.7047",
            "美元:港幣": "7.7501",
            "美元:人民幣": "6.6725",
            "美元:南非幣": "16.49575",
            "紐幣:美元": "0.6575"
          },
          {
            "日期": "20201021",
            "美元:新台幣": "28.892",
            "人民幣:新台幣": "4.3518",
            "歐元:美元": "1.18665",
            "美元:日幣": "104.985",
            "英鎊:美元": "1.3056",
            "澳幣:美元": "0.70845",
            "美元:港幣": "7.75005",
            "美元:人民幣": "6.6391",
            "美元:南非幣": "16.3953",
            "紐幣:美元": "0.66225"
          },
          {
            "日期": "20201022",
            "美元:新台幣": "28.903",
            "人民幣:新台幣": "4.337791",
            "歐元:美元": "1.18505",
            "美元:日幣": "104.61",
            "英鎊:美元": "1.31265",
            "澳幣:美元": "0.7107",
            "美元:港幣": "7.75005",
            "美元:人民幣": "6.66305",
            "美元:南非幣": "16.30495",
            "紐幣:美元": "0.6665"
          },
          {
            "日期": "20201023",
            "美元:新台幣": "28.917",
            "人民幣:新台幣": "4.344953",
            "歐元:美元": "1.1836",
            "美元:日幣": "104.575",
            "英鎊:美元": "1.3105",
            "澳幣:美元": "0.71445",
            "美元:港幣": "7.75005",
            "美元:人民幣": "6.6553",
            "美元:南非幣": "16.17815",
            "紐幣:美元": "0.669"
          },
          {
            "日期": "20201026",
            "美元:新台幣": "28.902",
            "人民幣:新台幣": "4.321167",
            "歐元:美元": "1.18305",
            "美元:日幣": "104.895",
            "英鎊:美元": "1.30015",
            "澳幣:美元": "0.71165",
            "美元:港幣": "7.75005",
            "美元:人民幣": "6.68845",
            "美元:南非幣": "16.29195",
            "紐幣:美元": "0.66805"
          },
          {
            "日期": "20201027",
            "美元:新台幣": "28.872",
            "人民幣:新台幣": "4.303978",
            "歐元:美元": "1.1804",
            "美元:日幣": "104.785",
            "英鎊:美元": "1.3008",
            "澳幣:美元": "0.7123",
            "美元:港幣": "7.75005",
            "美元:人民幣": "6.7082",
            "美元:南非幣": "16.2276",
            "紐幣:美元": "0.6681"
          },
          {
            "日期": "20201028",
            "美元:新台幣": "28.906",
            "人民幣:新台幣": "4.302745",
            "歐元:美元": "1.1756",
            "美元:日幣": "104.26",
            "英鎊:美元": "1.3006",
            "澳幣:美元": "0.71305",
            "美元:港幣": "7.75005",
            "美元:人民幣": "6.71805",
            "美元:南非幣": "16.29135",
            "紐幣:美元": "0.66955"
          },
          {
            "日期": "20201029",
            "美元:新台幣": "28.914",
            "人民幣:新台幣": "4.308822",
            "歐元:美元": "1.1728",
            "美元:日幣": "104.325",
            "英鎊:美元": "1.29915",
            "澳幣:美元": "0.70535",
            "美元:港幣": "7.75125",
            "美元:人民幣": "6.7104",
            "美元:南非幣": "16.4038",
            "紐幣:美元": "0.66485"
          },
          {
            "日期": "20201030",
            "美元:新台幣": "28.925",
            "人民幣:新台幣": "4.318647",
            "歐元:美元": "1.1682",
            "美元:日幣": "104.335",
            "英鎊:美元": "1.2936",
            "澳幣:美元": "0.7033",
            "美元:港幣": "7.75275",
            "美元:人民幣": "6.6977",
            "美元:南非幣": "16.30745",
            "紐幣:美元": "0.6627"
          },
          {
            "日期": "20201102",
            "美元:新台幣": "28.909",
            "人民幣:新台幣": "4.315102",
            "歐元:美元": "1.1634",
            "美元:日幣": "104.845",
            "英鎊:美元": "1.28835",
            "澳幣:美元": "0.7008",
            "美元:港幣": "7.75365",
            "美元:人民幣": "6.6995",
            "美元:南非幣": "16.2742",
            "紐幣:美元": "0.66005"
          },
          {
            "日期": "20201103",
            "美元:新台幣": "28.92",
            "人民幣:新台幣": "4.323395",
            "歐元:美元": "1.1671",
            "美元:日幣": "104.62",
            "英鎊:美元": "1.29425",
            "澳幣:美元": "0.70795",
            "美元:港幣": "7.75055",
            "美元:人民幣": "6.6892",
            "美元:南非幣": "16.1297",
            "紐幣:美元": "0.6652"
          },
          {
            "日期": "20201104",
            "美元:新台幣": "29.006",
            "人民幣:新台幣": "4.30945",
            "歐元:美元": "1.1657",
            "美元:日幣": "104.995",
            "英鎊:美元": "1.29155",
            "澳幣:美元": "0.70745",
            "美元:港幣": "7.7519",
            "美元:人民幣": "6.7308",
            "美元:南非幣": "16.3262",
            "紐幣:美元": "0.6629"
          },
          {
            "日期": "20201105",
            "美元:新台幣": "28.874",
            "人民幣:新台幣": "4.352958",
            "歐元:美元": "1.175",
            "美元:日幣": "104.325",
            "英鎊:美元": "1.3023",
            "澳幣:美元": "0.72015",
            "美元:港幣": "7.75375",
            "美元:人民幣": "6.6332",
            "美元:南非幣": "15.84885",
            "紐幣:美元": "0.6722"
          },
          {
            "日期": "20201106",
            "美元:新台幣": "28.876",
            "人民幣:新台幣": "4.363279",
            "歐元:美元": "1.18385",
            "美元:日幣": "103.55",
            "英鎊:美元": "1.31365",
            "澳幣:美元": "0.7268",
            "美元:港幣": "7.75295",
            "美元:人民幣": "6.61795",
            "美元:南非幣": "15.7428",
            "紐幣:美元": "0.6792"
          }
        ]
      }

    },
    mutations: {
      
    },
    getters: {
      getChartData: (state, getters) => {
          if(state.selectData != 'User permissions'){
            return state[state.selectData] ;
          }else{
            let temp = {
              columns: ['權限等級', '人數'],
              rows: [
                {'權限等級':1,'人數':0},
                {'權限等級':2,'人數':0},
                {'權限等級':3,'人數':0},
                {'權限等級':4,'人數':0},
                {'權限等級':5,'人數':0},
              ]
            }

            let data={};
            
            Object.keys(state.user).forEach(key => {
              if(data[state.user[key]]){
                data[state.user[key]] += 1
              }else{
                data = Object.assign({[state.user[key]]:1},data)
              }
            })
            console.log(data);
            temp.rows[0].人數 = data['1'];
            temp.rows[1].人數 = data['2'];
            temp.rows[2].人數 = data['3'];
            temp.rows[3].人數 = data['4'];
            temp.rows[4].人數 = data['5'];


            return temp ;
          }

      },
      
  }

})
    export default index;